Тест/Тест/src/Catalogs/ВидыРасходов_3/ВидыРасходов_3.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыРасходов_3</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>План</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Влияние</name>
    <type>
      <types>CatalogRef.ВлиянияРасходы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаВлияние</name>
    <attributes>
      <name>Влияние</name>
      <type>
        <types>CatalogRef.ВлиянияРасходы</types>
      </type>
    </attributes>
    <attributes>
      <name>Метка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест/Тест/src/Catalogs/ВидыРасходов_3/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ТаблицаВлияниеВлияниеПриИзменении(Элемент)

	Элементы.ТаблицаВлияние.ТекущиеДанные.Метка = Элементы.ТаблицаВлияние.ТекущиеДанные.Влияние.Метка; 
	
КонецПроцедуры



&НаСервере
Функция СсылкаКатегорияВидРасхода3()
	
 Запрос = Новый Запрос;
 Запрос.Текст =
 	"ВЫБРАТЬ
 	|	ВидыРасходов_3.Код КАК Код
 	|ИЗ
 	|	Справочник.ВидыРасходов_3 КАК ВидыРасходов_3
 	|ГДЕ
 	|	ВидыРасходов_3.Код = &Код";

 Запрос.УстановитьПараметр("Код","000000001");
 РезультатЗапроса = Запрос.Выполнить();
 
 ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
 
 Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
 	Возврат ВыборкаДетальныеЗаписи.Код;
 КонецЦикла;
	
	
КонецФункции
&НаСервере
Функция СсылкаРодительФилиала()

	РодительКатегории 		= объект.Родитель; 	
	РодительФилиалаКод		= РодительКатегории.Родитель.Код;
	
	Возврат РодительФилиалаКод; 
	
КонецФункции

&НаСервере
Функция СсылкаРодительСтатья()

	Категории 		= объект.Родитель; 	
	Одел			= Категории.Родитель;
	Филиал			= Одел.Родитель;
	КореньКод			= Филиал.Родитель.Код; 
	
	Возврат КореньКод; 
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если СсылкаРодительФилиала() = СсылкаКатегорияВидРасхода3()  Тогда
		Элементы.План.Видимость = Истина;
		Элементы.ТаблицаВлияние.Видимость = Истина;  
	Иначе 
		Элементы.План.Видимость = Ложь;
		Элементы.ТаблицаВлияние.Видимость = Ложь;   
	КонецЕсли; 
	
	Если СсылкаРодительСтатья() = СсылкаКатегорияВидРасхода3()  Тогда
		Элементы.Влияние.Видимость = Истина;
	Иначе 
		Элементы.Влияние.Видимость = Ложь;
		  
	КонецЕсли;
	
КонецПроцедуры
